/**
 ******************************************************************************
 * @file    asp_param
 * @author  暄暄
 * @date    2022-2-20
 * @brief   参数的保存和还原
 * ==此文件用户不应变更==
 *****************************************************************************/

#ifndef __asp_param_H
#define __asp_param_H

#include "sp_common.h"

/* 自动初始化参数 */
void asp_auto_init_param(void);

/* 参数保存 */
void asp_param_save(void);

#endif

/*********************************** END OF FILE ***********************************/
