/**
 ******************************************************************************
 * @file    common
 * @author  暄暄
 * @date    2024-9-25
 * @brief   公共包含
 * ==可以在此文件添加用户头文件==
 *****************************************************************************/

#ifndef __common_H
#define __common_H

/* ==用户代码区 开始== */

#include "sloop.h"
#include "main.h"
#include "service_api.h"
#include "gpio_config.h"

/* ==用户代码区 结束== */

#endif /* __common_H */

/*********************************** END OF FILE ***********************************/
